<img width="200" style="float:right" src="https://github.com/danielscarvalho/Insper-DS-Dicas/blob/master/Insper-Logo.png?raw=true">

# Computação para Ciências dos Dados

<sub><a href="https://www.insper.edu.br/pos-graduacao/programas-avancados/programa-avancado-em-data-science-e-decisao/">PÓS-GRADUAÇÃO EM DATA SCIENCE E DECISÃO</a></sub>

## Dica do Dia: 011

O objetivo desta dica do dia é aprender mais sobre o dataframe Pandas, como criar novas colunas e processar os dados linha a linha (iteração):

> Todos os dias no período de contingência pelo Coronavirus (COVID-19) vamos enviar uma breve dica sobre Python para ciências dos dados em um jupyter notebook, conteúdo adicional ao curso que pode ser utilizado nos projetos

### Pandas

1. Podemos utilizar o índice do dataframe para iterar nos dados, e criar um dataframe novo e/ou novas colunas

In [71]:
import pandas as pd

lista = ['a','b','c']

df_base = pd.DataFrame(lista + ['d','e','f'], columns=["nome"])

df_i = pd.DataFrame() #Novo dataframe vazio

df_i['x'] = None

for i in range(0, len(df_base)): 
    
    df_i = df_i.append(df_base.iloc[i])
    
    if df_i.loc[i, 'nome'] in lista:
        df_i.loc[i, 'value'] = 120
        df_i.loc[i, 'x'] = 1
    else:
        df_i.loc[i, 'value'] = -100

df_i

     x nome  value
0  1.0    a  120.0
1  1.0    b  120.0
2  1.0    c  120.0
3  NaN    d -100.0
4  NaN    e -100.0
5  NaN    f -100.0

2. Podemos iterar nas linhas (rows) do dataframe, ou pelo ídice (i) da seguinte forma:

In [58]:
import numpy as np

df_new = pd.DataFrame()

df_new['y'] = 0 #define todos os valores da coluna y como 0 (zero)

for i, row in df_base.iterrows():
    df_new = df_new.append(row)
    print(i, row['nome'])

df_new.loc[df_new['nome'].isin(lista),'y'] = 1 #O que está na lista y = 1

df_new

0 a
1 b
2 c
3 d
4 e
5 f

     y nome
0  1.0    a
1  1.0    b
2  1.0    c
3  NaN    d
4  NaN    e
5  NaN    f

3. Esta é a forma mais fácil, utilizando programação funcional podemos aplicar uma função a uma coluna e criar outra coluna nova, no dataframe original

In [85]:
#Função: se nome consta na lista o valor é 1 se não 0
def fz(z):
    if z in lista:
        return 1
    else:
        return 0

df_base['z'] = df_base.nome.apply(fz)

df_base

  nome  z
0    a  1
1    b  1
2    c  1
3    d  0
4    e  0
5    f  0

Criar uma coluna nova calculada

In [82]:
df_ticket = pd.DataFrame([['i',1,23.3],['j',20,4.2],['k',30,4.22],['i',2,42.22]],columns=["type","qtd","val"])

df_ticket["total"] = df_ticket["qtd"] * df_ticket["val"]

df_ticket

  type  qtd    val   total
0    i    1  23.30   23.30
1    j   20   4.20   84.00
2    k   30   4.22  126.60
3    i    2  42.22   84.44

Podemos fazer consutas (query), note que em um string

In [83]:
df_ticket.query('qtd > 10')

  type  qtd   val  total
1    j   20  4.20   84.0
2    k   30  4.22  126.6

In [84]:
df_ticket.query('qtd > 10 and total < 100')

  type  qtd  val  total
1    j   20  4.2   84.0

In [85]:
df_ticket.query('val > 10')

  type  qtd    val  total
0    i    1  23.30  23.30
3    i    2  42.22  84.44

In [87]:
df_ticket.query('type == "i"')

  type  qtd    val  total
0    i    1  23.30  23.30
3    i    2  42.22  84.44

Para saber mais:

- https://www.geeksforgeeks.org/python-pandas-dataframe-append/
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.apply.html?highlight=apply#pandas.Series.apply
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.query.html

Extra: Sobre as formas normais de banco de dados, que se aplicam a qualquer tipo de dado estruturado tal como planilha ou dataframe:

- https://docs.microsoft.com/pt-br/office/troubleshoot/access/database-normalization-description
- https://medium.com/@diegobmachado/normaliza%C3%A7%C3%A3o-em-banco-de-dados-5647cdf84a12
- https://pt.wikipedia.org/wiki/Normaliza%C3%A7%C3%A3o_de_dados